Revit.Elements.FamilyInstance.Room
The room in which the instance is located.

Revit.Elements.FamilyInstance.Space
The space in which the instance is located.

Revit.Elements.FamilyInstance.ByCoordinateSystem(Revit.Elements.FamilyType,Autodesk.DesignScript.Geometry.CoordinateSystem)
Place a Revit FamilyInstance given the FamilyType (also known as the FamilySymbol in the Revit API) and its coordinate system.
familyType: Family Type. Also called Family Symbol.
coordinateSystem: Coordinates system to place the new family instance in.
Returns: New family instance.

Revit.Elements.FamilyInstance.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforms this FamilyInstance from a source CoordinateSystem to a new context CoordinateSystem.
fromCoordinateSystem: Source CoordinatSystem
contextCoordinateSystem: Context CordinateSystem
Returns: Transformed Element